Revit 2027 API
ExportUtils.GetNurbsSurfaceDataForSurface Method
 Returns the necessary information to define a NURBS surface for a given [!:Autodesk::Revit::DB::HermiteSuface] or [!:Autodesk::Revit::DB::RuledSuface].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static NurbsSurfaceData GetNurbsSurfaceDataForSurface(
	Surface surface
)
Public Shared Function GetNurbsSurfaceDataForSurface (
	surface As Surface
) As NurbsSurfaceData
public:
static NurbsSurfaceData^ GetNurbsSurfaceDataForSurface(
	Surface^ surface
)
static member GetNurbsSurfaceDataForSurface :
        surface : Surface -> NurbsSurfaceData
Parameters
surface Surface
 The HermiteSurface or RuledSurface to be converted.
Return Value
NurbsSurfaceData
 A class containing the necessary data to define a NURBS surface.
Exceptions
Exception | Condition
ArgumentException |  This surface type is not supported for this function.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Couldn't get NURBS data from surface.
Remarks
 This function is intended for export purposes.
See Also
Reference
ExportUtils Class
Autodesk.Revit.DB Namespace